/**
 * Created by kuanchang on 16/4/17.
 * 此类定义公用常量
 */

/**
 * 各种单据的状态信息
 * 启用：1
 * 停用：0
 */
exports.STATE_ENABLE = '1';
exports.STATE_DISABLE = '0';
/**
 * 定义折扣信息显示值和计算值
 * @type {Array}
 */
exports.DISCOUNT_NAMES = new Array("9折","85折","8折","75折","7折","65折","6折","55折","5折","45折","4折","35折");//定义折扣信息显示值
exports.DISCOUNT_VALUES = new Array("0.9","0.85","0.8","0.75","0.7","0.65","0.6","0.55","0.5","0.45","0.4","0.35");//定义折扣信息计算值
/**
 * //排课使用的时间段
 * @type {Array}
 */
exports.COURSE_DATE = new Array('8:00','8:30','9:00','9:30','10:00','10:30','11:00','11:30','12:00','14:00','14:30','15:00','15:30','16:00','16:30','17:00','17:30','18:00','18:30','19:00','19:30');


/**
 * 地区名称及地区code
 * @type {Array}
 */
exports.AREA_NAMES = new Array("东城区","西城区","海淀区","朝阳区","丰台区","石景山区","门头沟区","通州区","顺义区","房山区","大兴区","昌平区","怀柔区","平谷区","密云县","延庆县");//定义折扣信息显示值
exports.AREA_CODES = new Array("110101","110102","110108","110105","110106","110107","110109","110112","110113","110111","110115","110114","110116","110117","110228","110229");//定义折扣信息计算值